# Pandas

## 1.Create a DataFrame with columns Name, Age, and City for 3 people. Then,print only the Name and City columns.

In [1]:
import pandas as pd

In [6]:
Person_details=pd.DataFrame(data={"Name":["Kamali","Chandra","Cheran"],"Age":[25,26,22],"City":["Nagapattinam","Andhra Pradesh","Nagapattinam"]})
Person_details

      Name  Age            City
0   Kamali   25    Nagapattinam
1  Chandra   26  Andhra Pradesh
2   Cheran   22    Nagapattinam

In [10]:
Person_details[["Name","City"]]

      Name            City
0   Kamali    Nagapattinam
1  Chandra  Andhra Pradesh
2   Cheran    Nagapattinam

## 2.Using the DataFrame above, add a new column Age_Group where:
* -If Age < 25, it's 'Youth'
* -Otherwise, it's 'Adult'

In [15]:
Person_details["Age_Group"]=Person_details["Age"].apply(lambda Age:  "Youth" if Age < 25 else "Adult")
Person_details

      Name  Age            City Age_Group
0   Kamali   25    Nagapattinam     Adult
1  Chandra   26  Andhra Pradesh     Adult
2   Cheran   22    Nagapattinam     Youth

## 3. You have the following data about employees:
* Group the DataFrame by the Department column and calculate the average
salary for each department.

In [17]:
import pandas as pd
data = {
'Department': ['IT', 'HR', 'IT', 'Finance', 'HR', 'Finance'],
'Employee': ['A', 'B', 'C', 'D', 'E', 'F'],
'Salary': [60000, 52000, 75000, 67000, 58000, 72000]
}
df = pd.DataFrame(data)
df

  Department Employee  Salary
0         IT        A   60000
1         HR        B   52000
2         IT        C   75000
3    Finance        D   67000
4         HR        E   58000
5    Finance        F   72000

In [40]:
avg_salary = df.groupby("Department")["Salary"].mean().reset_index()
avg_salary

  Department   Salary
0    Finance  69500.0
1         HR  55000.0
2         IT  67500.0

## 4. You are given the following DataFrame:

* Write Python code to fill the missing values in the "Age" column with the average age of all non-null entries.

In [62]:
import pandas as pd

data = {
'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
'Age': [25, None, 30, None, 22],
'Department': ['HR', 'IT', 'HR', 'Finance', 'IT']
}
df = pd.DataFrame(data)

In [63]:
df

      Name   Age Department
0    Alice  25.0         HR
1      Bob   NaN         IT
2  Charlie  30.0         HR
3    David   NaN    Finance
4      Eve  22.0         IT

In [67]:
Avg_age=df["Age"].mean()
Avg_age
df["Age"].fillna(Avg_age)
df

      Name        Age
0    Alice  25.000000
1      Bob  25.666667
2  Charlie  30.000000
3    David  25.666667
4      Eve  22.000000